--- crates/graphforge-cli/src/portable_cli.rs
+++ replace <impl From<PortableFormat> for PortableV2Output>::from -> Self with Default::default()
@@ -97,20 +97,17 @@
 #[derive(Clone, Copy, ValueEnum)]
 enum PortableFormat {
     Expanded,
     Bundle,
 }
 
 impl From<PortableFormat> for PortableV2Output {
     fn from(value: PortableFormat) -> Self {
-        match value {
-            PortableFormat::Expanded => Self::Expanded,
-            PortableFormat::Bundle => Self::Bundle,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[derive(Clone, Copy, ValueEnum)]
 enum VerifyMode {
     Inspect,
     Full,
 }
