--- crates/graphforge-cli/src/portable_cli.rs
+++ delete ! in run_portable
@@ -251,17 +251,17 @@
                         output_path: args.output,
                         representation: args.format.into(),
                         profile: args.profile.into(),
                         subset: None,
                         limits: PortableV2Limits::default(),
                     },
                     None,
                     |progress| {
-                        if !json {
+                        if  /* ~ changed by cargo-mutants ~ */json {
                             let _ = writeln!(
                                 output,
                                 "export progress entries={}/{} bytes={}/{}",
                                 progress.entries_completed,
                                 progress.entries_total,
                                 progress.bytes_completed,
                                 progress.bytes_total
                             );
