--- crates/graphforge-cli/src/portable_cli.rs
+++ delete match arm (false, Some(name)) in selection_flag
@@ -32,17 +32,17 @@
 }
 
 fn selection_flag(
     current: bool,
     checkpoint: Option<String>,
 ) -> Result<PortableSelection, graphforge_api::GfError> {
     match (current, checkpoint) {
         (true, None) => Ok(PortableSelection::Current),
-        (false, Some(name)) => Ok(PortableSelection::Checkpoint(name)),
+         /* ~ changed by cargo-mutants ~ */
         _ => Err(graphforge_api::GfError::Validation(
             "exactly one of --current or --checkpoint is required".into(),
         )),
     }
 }
 
 #[derive(Subcommand)]
 pub(crate) enum PortableCommand {
