--- crates/graphforge-cli/src/portable_cli.rs
+++ replace run_query -> Result<(), graphforge_api::GfError> with Ok(())
@@ -480,63 +480,17 @@
 }
 
 pub(crate) fn run_query(
     graph: &GraphForge,
     args: &QueryArgs,
     json: bool,
     output: &mut dyn Write,
 ) -> Result<(), graphforge_api::GfError> {
-    let options = ResultSinkOptions {
-        max_batch_rows: args.max_batch_rows.unwrap_or(65_536),
-        max_row_group_rows: args.max_row_group_rows.unwrap_or(65_536),
-    };
-    let path = args.output.to_str().ok_or_else(|| {
-        graphforge_api::GfError::Validation("query --output must be valid UTF-8".into())
-    })?;
-    let params = std::collections::HashMap::new();
-    let format = match args.format {
-        QuerySinkFormat::Parquet => graphforge_api::ResultSinkFormat::Parquet,
-        QuerySinkFormat::ArrowIpc => graphforge_api::ResultSinkFormat::ArrowIpc,
-    };
-    let receipt = graph.execute_to_result_sink_with_evidence(
-        &args.cypher,
-        &params,
-        path,
-        format,
-        &options,
-        None,
-    )?;
-    if json {
-        write_json(
-            &serde_json::json!({
-                "contract": "graphforge-result-sink/2",
-                "destination": receipt.sink.destination,
-                "format": format!("{:?}", receipt.sink.format),
-                "rows": receipt.sink.progress.rows,
-                "batches": receipt.sink.progress.batches,
-                "bytes": receipt.sink.progress.bytes,
-                "complete": receipt.sink.progress.complete,
-                "result_sha256": receipt.result_sha256,
-                "scalar_u64": receipt.scalar_u64,
-                "query_evidence": receipt.evidence,
-            }),
-            output,
-        )?;
-    } else {
-        writeln!(
-            output,
-            "wrote {} rows={} bytes={}",
-            receipt.sink.destination.display(),
-            receipt.sink.progress.rows,
-            receipt.sink.progress.bytes
-        )
-        .map_err(|error| graphforge_api::GfError::Execution(error.to_string()))?;
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 #[derive(Subcommand)]
 pub(crate) enum ImportSessionCommand {
     /// Open a new staged import session.
     Begin(ImportSessionBeginArgs),
     /// Resume an existing session by UUID.
     Resume(ImportSessionResumeArgs),
