--- crates/graphforge-cli/src/portable_cli.rs
+++ replace write_import_commit -> Result<(), graphforge_api::GfError> with Ok(())
@@ -690,37 +690,17 @@
 }
 
 fn write_import_commit(
     session: &graphforge_api::GraphImportSession,
     generation: Uuid,
     json: bool,
     output: &mut dyn Write,
 ) -> Result<(), graphforge_api::GfError> {
-    let (_, progress) = session.status();
-    if json {
-        write_json(
-            &serde_json::json!({
-                "contract": "graphforge-import-session/1",
-                "outcome": "committed",
-                "session_uuid": session.session_uuid(),
-                "generation_uuid": generation,
-                "construction": progress.construction,
-                "operation_timings": session.operation_timings(),
-            }),
-            output,
-        )
-    } else {
-        writeln!(
-            output,
-            "committed session {} generation {generation}",
-            session.session_uuid()
-        )
-        .map_err(|error| graphforge_api::GfError::Execution(error.to_string()))
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn write_session_receipt(
     session_uuid: Uuid,
     outcome: &str,
     json: bool,
     output: &mut dyn Write,
 ) -> Result<(), graphforge_api::GfError> {
