--- crates/graphforge-cli/src/portable_cli.rs
+++ replace write_session_receipt -> Result<(), graphforge_api::GfError> with Ok(())
@@ -719,29 +719,17 @@
 }
 
 fn write_session_receipt(
     session_uuid: Uuid,
     outcome: &str,
     json: bool,
     output: &mut dyn Write,
 ) -> Result<(), graphforge_api::GfError> {
-    if json {
-        write_json(
-            &serde_json::json!({
-                "contract": "graphforge-import-session/1",
-                "outcome": outcome,
-                "session_uuid": session_uuid,
-            }),
-            output,
-        )
-    } else {
-        writeln!(output, "{outcome} session {session_uuid}")
-            .map_err(|error| graphforge_api::GfError::Execution(error.to_string()))
-    }
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn write_progress(
     session_uuid: Uuid,
     outcome: &str,
     progress: &graphforge_api::ImportProgress,
     timings: Option<graphforge_api::ImportOperationTimings>,
     json: bool,
